In [1]:
# Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import scipy.stats as st
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy import Column, Integer, String, Float
from config import pkey

In [5]:
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.8.6-cp37-cp37m-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6

In [6]:
engine = create_engine(f'postgresql://postgres:{pkey}@localhost:5432/EmployeeSQL')
##engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/dbname')
connection = engine.connect()

In [7]:
salaries = pd.read_sql("select * from salaries", connection)
salaries.head()

  emp_no salary
0  10001  60117
1  10002  65828
2  10003  40006
3  10004  40054
4  10005  78228

In [9]:
titles = pd.read_sql("select * from titles", connection)
titles.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [11]:
employees = pd.read_sql("select * from employees", connection)
employees.rename(columns={'emp_title':'title_id'}, inplace = True)
employees.head()

   emp_no title_id  birth_date  first_name  last_name sex   hire_date
0  473302    s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053    e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444    e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786    s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238    e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [12]:
##merge employees with titles on emp_title and title_id, change name of 
combined_df = pd.merge(employees, titles, on='title_id')
combined_df.head()

   emp_no title_id  birth_date  first_name   last_name sex   hire_date  title
0  473302    s0001  1953-07-25    Hideyuki    Zallocco   M  1990-04-28  Staff
1  421786    s0001  1957-09-28       Xiong    Verhoeff   M  1987-11-26  Staff
2  273487    s0001  1957-04-14   Christoph     Parfitt   M  1991-06-28  Staff
3  246449    s0001  1958-03-23       Subbu  Bultermann   F  1988-03-25  Staff
4   48085    s0001  1964-01-19  Venkatesan        Gilg   M  1993-06-28  Staff

In [14]:
final_df = pd.merge(combined_df, salaries, on='emp_no')
final_df.head()

,emp_no,title_id,birth_date,first_name,last_name,sex,hire_date,title,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,Staff,40000
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,Staff,40000
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,Staff,56087
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,Staff,87084
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,Staff,63016